# String pattern, sorting and groupings

- Load the database: Using the skills acquired in the previous modules, you should first create the database in MySQL. Follow the steps below:

- Open the mysql dbin Cloud IDE.

- Create a blank database named ‘HR’. Use the script shared in the link below to create the required tables.

- Download the files in the links below to your local machine:

1. Departments.csv 

- - '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Departments.csv'
2. Jobs.csv

- - '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Jobs.csv'
3. JobsHistory.csv

- - '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/JobsHistory.csv'
4. Locations.csv

- - '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Locations.csv'
5. Employees.csv

- - '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Employee.csv'

In [1]:
import mysql.connector as sql 
import pandas as pd 
from sqlalchemy import create_engine

import os 
from dotenv import load_dotenv

In [2]:
load_dotenv('/workspaces/IBM-DS-Course/.env')
user = os.getenv('USER')
password = os.getenv('PASSWORD')
host = 'localhost'
port = 3306
db = 'HR'

In [3]:
conn = sql.connect(
    host=host,
    user=user,
    password=password,
    port=port
)

In [4]:
cursor = conn.cursor()
create_db = f'CREATE DATABASE IF NOT EXISTS {db}'
cursor.execute(create_db)

In [5]:
sql_file_path = '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Script_Create_Tables.sql'
with open(sql_file_path, 'r') as sql_file:
    sql_script = sql_file.read()

In [38]:
use = f'USE {db}'
cursor.execute(use)
try:
    for statement in sql_script.split(';'):
        if statement.strip():
            cursor.execute(statement)
        conn.commit()
        print("Sucess")
except Exception as e:
    print(f"Failed because {e}")

Sucess
Sucess
Sucess
Sucess
Sucess
Sucess
Sucess
Sucess
Sucess
Sucess
Sucess

In [39]:
cursor.execute("SHOW TABLES;")
output = cursor.fetchall()


table_names = [table[0] for table in output]
table_names

['DEPARTMENTS', 'EMPLOYEES', 'JOBS', 'JOB_HISTORY', 'LOCATIONS']

In [43]:
table_dict = {}
for table in table_names:
    table_query = f'SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = "{table}" AND TABLE_SCHEMA = "{db}" ORDER BY ORDINAL_POSITION;'
    # print(f"Executing query for table {table}: {table_query}")  # Debugging statement

    cursor.execute(table_query)
    cols = cursor.fetchall()
    # print(f"Columns fetched for table {table}: {cols}")  # Debugging statement

    table_dict[table] = [col[0] for col in cols]

Executing query for table DEPARTMENTS: SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = "DEPARTMENTS" AND TABLE_SCHEMA = "HR" ORDER BY ORDINAL_POSITION;
Columns fetched for table DEPARTMENTS: [('DEPT_ID_DEP',), ('DEP_NAME',), ('MANAGER_ID',), ('LOC_ID',)]
Executing query for table EMPLOYEES: SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = "EMPLOYEES" AND TABLE_SCHEMA = "HR" ORDER BY ORDINAL_POSITION;
Columns fetched for table EMPLOYEES: [('EMP_ID',), ('F_NAME',), ('L_NAME',), ('SSN',), ('B_DATE',), ('SEX',), ('ADDRESS',), ('JOB_ID',), ('SALARY',), ('MANAGER_ID',), ('DEP_ID',)]
Executing query for table JOBS: SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = "JOBS" AND TABLE_SCHEMA = "HR" ORDER BY ORDINAL_POSITION;
Columns fetched for table JOBS: [('JOB_IDENT',), ('JOB_TITLE',), ('MIN_SALARY',), ('MAX_SALARY',)]
Executing query for table JOB_HISTORY: SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = "JOB_HISTORY" AND TABLE_SCHEMA = "HR" ORDER BY ORDINAL_POSITION;
Columns fetched for table JOB_HISTORY: [('EMPL_ID',), ('START_DATE',), ('JOBS_ID',), ('DEPT_ID',)]
Executing query for table LOCATIONS: SELECT COLUMN_NAME FROM INFORMATION_SCHEMA.COLUMNS WHERE TABLE_NAME = "LOCATIONS" AND TABLE_SCHEMA = "HR" ORDER BY ORDINAL_POSITION;
Columns fetched for table LOCATIONS: [('LOCT_ID',), ('DEP_ID_LOC',)]

In [44]:
table_dict

{'DEPARTMENTS': ['DEPT_ID_DEP', 'DEP_NAME', 'MANAGER_ID', 'LOC_ID'],
 'EMPLOYEES': ['EMP_ID',
  'F_NAME',
  'L_NAME',
  'SSN',
  'B_DATE',
  'SEX',
  'ADDRESS',
  'JOB_ID',
  'SALARY',
  'MANAGER_ID',
  'DEP_ID'],
 'JOBS': ['JOB_IDENT', 'JOB_TITLE', 'MIN_SALARY', 'MAX_SALARY'],
 'JOB_HISTORY': ['EMPL_ID', 'START_DATE', 'JOBS_ID', 'DEPT_ID'],
 'LOCATIONS': ['LOCT_ID', 'DEP_ID_LOC']}

{'DEPARTMENTS': ['DEPT_ID_DEP', 'DEP_NAME', 'MANAGER_ID', 'LOC_ID'],

 'EMPLOYEES': ['EMP_ID',
  'F_NAME',
  'L_NAME',
  'SSN',
  'B_DATE',
  'SEX',
  'ADDRESS',
  'JOB_ID',
  'SALARY',
  'MANAGER_ID',
  'DEP_ID'],

 'JOBS': ['JOB_IDENT', 'JOB_TITLE', 'MIN_SALARY', 'MAX_SALARY'],

 'JOB_HISTORY': ['EMPL_ID', 'START_DATE', 'JOBS_ID', 'DEPT_ID'],
 
 'LOCATIONS': ['LOCT_ID', 'DEP_ID_LOC']}

In [45]:
DPMT_PATH = '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Departments.csv'
EMP_PATH = '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Employees.csv'
JOBS_PATH = '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Jobs.csv'
JOBS_HSTR_PATH = '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/JobsHistory.csv'
LOCAL_PATH = '/workspaces/IBM-DS-Course/Course 6 Db and SQL /Module 3 Filter & aggregations clause/3.1 .sql & .csv/Locations.csv'

In [46]:
DEPARTMENTS_df = pd.read_csv(DPMT_PATH, header=None)
EMPLOYEES_df = pd.read_csv(EMP_PATH, header=None)
JOBS_df =  pd.read_csv(JOBS_PATH, header=None)
JOB_HISTORY_df =  pd.read_csv(JOBS_HSTR_PATH, header=None)
LOCATIONS_df =  pd.read_csv(LOCAL_PATH, header=None)

In [47]:

df_dict = {
    'DEPARTMENTS': DEPARTMENTS_df,
    'EMPLOYEES': EMPLOYEES_df,
    'JOBS': JOBS_df,
    'JOB_HISTORY': JOB_HISTORY_df,
    'LOCATIONS': LOCATIONS_df
}
for table_name, columns in table_dict.items():
    # df_dict(f'{item}_df')  
    if table_name in df_dict:
        df_dict[table_name].columns = columns
        
    print(df_dict[table_name].columns, df_dict[table_name].shape)

Index(['DEPT_ID_DEP', 'DEP_NAME', 'MANAGER_ID', 'LOC_ID'], dtype='object') (3, 4)
Index(['EMP_ID', 'F_NAME', 'L_NAME', 'SSN', 'B_DATE', 'SEX', 'ADDRESS',
       'JOB_ID', 'SALARY', 'MANAGER_ID', 'DEP_ID'],
      dtype='object') (10, 11)
Index(['JOB_IDENT', 'JOB_TITLE', 'MIN_SALARY', 'MAX_SALARY'], dtype='object') (10, 4)
Index(['EMPL_ID', 'START_DATE', 'JOBS_ID', 'DEPT_ID'], dtype='object') (10, 4)
Index(['LOCT_ID', 'DEP_ID_LOC'], dtype='object') (3, 2)

In [13]:
connection_string = f'mysql+mysqlconnector://{user}:{password}@{host}/{db}'
engine = create_engine(connection_string)

In [48]:
for table_name, df in df_dict.items():
    df.to_sql(table_name, con=engine, if_exists='replace', index=False)
    print(f"Table {table_name} uploaded successfully.")
    
conn.commit()

Table DEPARTMENTS uploaded successfully.
Table EMPLOYEES uploaded successfully.
Table JOBS uploaded successfully.
Table JOB_HISTORY uploaded successfully.
Table LOCATIONS uploaded successfully.

## String Patterns

You can use string patterns to filter the response of a query. Let's look at the following example:

Say you need to retrieve the first names F_NAME and last names L_NAME of all employees who live in Elgin, IL. 

You can use the LIKE operator to retrieve strings that contain the said text. The code will look as shown below.

In [49]:
use = f'USE {db}'
cursor.execute(use)

In [51]:
cursor.execute("SELECT ADDRESS FROM EMPLOYEES WHERE ADDRESS LIKE'%Elgin,IL%';")
rows = cursor.fetchall()
for row in rows:
    print(row)

Sample data from EMPLOYEES:
('980 Berry ln, Elgin,IL',)
('111 Green Pl, Elgin,IL',)
('111 Britany Springs,Elgin,IL',)

Retrieve all employee records in department 5 where salary is between 60000 and 70000. The query that will be used is

In [53]:
cursor.execute("SELECT * FROM EMPLOYEES WHERE (SALARY BETWEEN 60000 AND 70000) AND DEP_ID = 5;")
output = cursor.fetchall()
for row in output:
    print(row)

('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5)

## Sorting

Retrieve a list of employees ordered by department ID.

In [54]:
cursor.execute("SELECT F_NAME, L_NAME, DEP_ID  FROM EMPLOYEES ORDER BY DEP_ID;")
output = cursor.fetchall()
for row in output:
    print(row)

('John', 'Thomas', 2)
('Ahmed', 'Hussain', 2)
('Nancy', 'Allen', 2)
('Alice', 'James', 5)
('Steve', 'Wells', 5)
('Santosh', 'Kumar', 5)
('Ann', 'Jacob', 5)
('Mary', 'Thomas', 7)
('Bharath', 'Gupta', 7)
('Andrea', 'Jones', 7)

output of the same query in descending order of department ID, and within each deaprtment, the records should be ordered in descending alphabetical order by last name. For descending order, you can make use of the DESC clause

In [56]:
cursor.execute("SELECT F_NAME, L_NAME, DEP_ID  FROM EMPLOYEES ORDER BY DEP_ID DESC, L_NAME DESC;")
output = cursor.fetchall()
for row in output:
    print(row)

('Mary', 'Thomas', 7)
('Andrea', 'Jones', 7)
('Bharath', 'Gupta', 7)
('Steve', 'Wells', 5)
('Santosh', 'Kumar', 5)
('Alice', 'James', 5)
('Ann', 'Jacob', 5)
('John', 'Thomas', 2)
('Ahmed', 'Hussain', 2)
('Nancy', 'Allen', 2)

## Grouping

retrieve the number of employees in the department.

In [61]:
cursor.execute("SELECT DEP_ID, COUNT(*) FROM EMPLOYEES GROUP BY DEP_ID;")
output = cursor.fetchall()
for row in output:
    print(row)

(2, 3)
(5, 4)
(7, 3)

retrieve the number of employees in the department and the average employee salary in the department.

In [63]:
cursor.execute("SELECT DEP_ID, COUNT(*), AVG(SALARY) FROM EMPLOYEES GROUP BY DEP_ID;")
output = cursor.fetchall()
for row in output:
    print(row)

(2, 3, Decimal('86666.6667'))
(5, 4, Decimal('65000.0000'))
(7, 3, Decimal('66666.6667'))

Label the computed columns in the result set of the last problem as NUM_EMPLOYEES and AVG_SALARY.

In [65]:
q1 = f'SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY" FROM EMPLOYEES GROUP BY DEP_ID;'
cursor.execute(q1)
output = cursor.fetchall()
for row in output:
    print(row)

(2, 3, Decimal('86666.6667'))
(5, 4, Decimal('65000.0000'))
(7, 3, Decimal('66666.6667'))

sort the result of the previous query by average salary.

In [67]:
q2 = f'SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY" FROM EMPLOYEES GROUP BY DEP_ID ORDER BY AVG_SALARY;'
cursor.execute(q2)
output = cursor.fetchall()
for row in output:
    print(row)

(5, 4, Decimal('65000.0000'))
(7, 3, Decimal('66666.6667'))
(2, 3, Decimal('86666.6667'))

 HAVING after the GROUP BY, and use the count() function in the HAVING clause instead of the column label

In [68]:
q3 = f'SELECT DEP_ID, COUNT(*) AS "NUM_EMPLOYEES", AVG(SALARY) AS "AVG_SALARY" FROM EMPLOYEES GROUP BY DEP_ID HAVING COUNT(*) < 4 ORDER BY AVG_SALARY;'
cursor.execute(q3)
output = cursor.fetchall()
for row in output:
    print(row)

(7, 3, Decimal('66666.6667'))
(2, 3, Decimal('86666.6667'))

# Practice Questions

Retrieve the list of all employees, first and last names, whose first names start with ‘S’.

In [74]:
prac_1 = "SELECT F_NAME, L_NAME FROM EMPLOYEES WHERE F_NAME LIKE 'S%';"
cursor.execute(prac_1)
output = cursor.fetchall()
for row in output:
    print(row)

('Steve', 'Wells')
('Santosh', 'Kumar')

Arrange all the records of the EMPLOYEES table in ascending order of the date of birth.

In [78]:
prac_2 = "SELECT * FROM EMPLOYEES ORDER BY B_DATE ASC;"
cursor.execute(prac_2)
output = cursor.fetchall()
for row in output:
    print(row)

('E1002', 'Alice', 'James', 123457, '1972-07-31', 'F', '980 Berry ln, Elgin,IL', 200, 80000, 30002, 5)
('E1007', 'Mary', 'Thomas', 123412, '1975-05-05', 'F', '100 Rose Pl, Gary,IL', 650, 65000, 30003, 7)
('E1001', 'John', 'Thomas', 123456, '1976-09-01', 'M', '5631 Rice, OakPark,IL', 100, 100000, 30001, 2)
('E1006', 'Nancy', 'Allen', 123411, '1978-06-02', 'F', '111 Green Pl, Elgin,IL', 600, 90000, 30001, 2)
('E1003', 'Steve', 'Wells', 123458, '1980-10-08', 'M', '291 Springs, Gary,IL', 300, 50000, 30002, 5)
('E1005', 'Ahmed', 'Hussain', 123410, '1981-04-01', 'M', '216 Oak Tree, Geneva,IL', 500, 70000, 30001, 2)
('E1010', 'Ann', 'Jacob', 123415, '1982-03-30', 'F', '111 Britany Springs,Elgin,IL', 220, 70000, 30002, 5)
('E1008', 'Bharath', 'Gupta', 123413, '1985-06-05', 'M', '145 Berry Ln, Naperville,IL', 660, 65000, 30003, 7)
('E1004', 'Santosh', 'Kumar', 123459, '1985-07-20', 'M', '511 Aurora Av, Aurora,IL', 400, 60000, 30002, 5)
('E1009', 'Andrea', 'Jones', 123414, '1990-09-07', 'F', '120 Fall Creek, Gary,IL', 234, 70000, 30003, 7)

Group the records in terms of the department IDs and filter them of ones that have average salary more than or equal to 60000. Display the department ID and the average salary.

In [83]:
prac_3 = "SELECT DEP_ID, AVG(SALARY) FROM EMPLOYEES GROUP BY DEP_ID HAVING AVG(SALARY) >= 60000;"
cursor.execute(prac_3)
output = cursor.fetchall()
for row in output:
    print(row)

(2, Decimal('86666.6667'))
(5, Decimal('65000.0000'))
(7, Decimal('66666.6667'))

For the problem above, sort the results for each group in descending order of average salary.

In [84]:
prac_4 = "ELECT DEP_ID, AVG(SALARY) FROM EMPLOYEES GROUP BY DEP_ID HAVING AVG(SALARY) >= 60000 ORDER BY AVG(SALARY) DESC;"
cursor.execute(prac_4)
output = cursor.fetchall()
for row in output:
    print(row)

ProgrammingError: 1064 (42000): You have an error in your SQL syntax; check the manual that corresponds to your MySQL server version for the right syntax to use near 'ELECT DEP_ID, AVG(SALARY) FROM EMPLOYEES GROUP BY DEP_ID HAVING AVG(SALARY) >= 6' at line 1